[{"id": "1463657848655818754", "text": "I am on a flight. The woman next to me asked me to put my mask on after I was done eating my fruit snacks. I rolled my eyes and she said “don’t roll your eyes.” I said DON’T TELL ME WHAT TO DO WITH MY EYES. Pity those still in the COVID cult.", "likes": 3774}, {"id": "1463296228045713412", "text": "My new book is out! \"A Plague Upon Our House: My Fight at the Trump White House to Stop COVID From Destroying America\" ", "likes": 2210}, {"id": "1463657968985985032", "text": "Just out @BMJ_Latest The time course and extent of breakthrough infections (2 doses, Pfizer vaccine) A study of over 83,000 people serially assessed demonstrates a gradual increase in risk across all adult age groups ", "likes": 690}, {"id": "1464020143923630085", "text": "I don't think he's on here but Bruce Lochore, Pres of the NZ Motor Caravan Association is a TOP MAN. Twice now (last year and this year) he has sent out newsletters across the membership asking them all to consider &amp; respect the needs of our community in the face of covid. ❤️", "likes": 468}, {"id": "1464019950461407240", "text": "There's something instinctively disgusting about people who support covid restrictions. Talking to them, listening to the things they want and expect, sickens me to my stomach. It's like they're missing a piece.", "likes": 296}, {"id": "1463658452526448640", "text": "I’m both really pleased about this, and also really fucked off about it. Thirteen years my life has been on hold due to drastically extreme fatigue. Yet suddenly there’s a drug that could have been helping all this time if it had had funding?😠🤬 #mecfs ", "likes": 253}, {"id": "1464020732283920390", "text": "In late 2019, early 2020, folks on Twitter who paid attention were aware that we were looking at the possibility of a pandemic. So if we are talking about a new and improved Covid, that might render our testing and vaccines moot, I'm definitely paying attention.", "likes": 233}, {"id": "1463295835987451907", "text": "Steve Burton fired from 'General Hospital' for refusal to get COVID-19 vaccine ", "likes": 214}, {"id": "1463295545246633990", "text": "If you are an Erie Co. bar or restaurant requiring proof of vaccination for entry, there are many of us on your side and we will patronize your establishment! We all prefer to be comfortable and safe. Please tweet with #vaccinatedpatronsonly so we can easily find you.", "likes": 213}, {"id": "1463296281527427076", "text": "6 week old Maisley Maxwell from #Wisconsin developed respiratory failure from COVID pneumonia complicated by a collapsed lung requiring a chest tube. Despite a ventilator she remained hypoxic, until she was placed on ECMO #TheySurvivedCovid ", "likes": 206}]